docs/1c-export-mobile/MobileAgent/InformationRegisters/Лог.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>Лог</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Лог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

docs/1c-export-mobile/MobileAgent/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаАкция</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонецАкции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

docs/1c-export-mobile/MobileAgent/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокДіїЛіцензії</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПросроченийБорг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БоргТзОВ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПросроченийБоргТзОВ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Область</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Области</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВідділенняНП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Власний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперативныйСтатусКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Маршруты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодАсортимета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыАсортимета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеТТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаСайт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Геолокация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъмЗаМесяц</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияТТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииТТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговыйАгент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеАгенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовоеСообщение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписанийВВайбере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактВайбер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактыViber</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейОтПоследнейПокупки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналПошуку</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КаналиПошуку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДиалога</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокСесия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Борг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботаСКлиентомПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботаСКлиентомЗапись</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОновлення</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Телефоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>19</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Месенджер</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыМесендеров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Маршруты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Маршрут</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Маршруты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Асортимент</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеРучнаяЗапись</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БанковскиеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БанковскийСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АсортиментПрезентацій</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеРучнаяЗапись</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоцМережі</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Коментар</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Посилання</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Мережа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидиСоцМереж</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПосиланняВБраузері</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

docs/1c-export-mobile/MobileAgent/CommonModules/Обмен_УправлениеОбменом/Ext/Module.bsl
//Функция ПолучитьПрокси() Экспорт
//	
//	//Адрес = "http://192.168.0.111:23/Workbase/ws/MobileExchange/MobileExchange.1cws?wsdl";
//	//Адрес = "http://134.119.204.210:8312/Workbase/ws/MobileExchange/MobileExchange.1cws?wsdl";
//	Адрес = "http://185.136.157.98:8312/Workbase/ws/MobileExchange/MobileExchange.1cws?wsdl";
//	Пользователь = "SOAP";
//	Пароль = "fsNFeyg76GDR4kdskKI9";
//	
//	Определения = Новый WSОпределения(Адрес,Пользователь,Пароль);
//	Константы.Определение.Установить(Новый ХранилищеЗначения(Определения));
//	URI = URIПространстваИменСервиса();
//	Прокси = Новый WSПрокси(Определения, URI, "MobileExchange", "MobileExchange" + "Soap");
//	Прокси.Пользователь = Пользователь;
//	Прокси.Пароль = Пароль;
//	
//	Возврат Прокси;
//	
//КонецФункции

//Функция URIПространстваИменСервиса() Экспорт
//	
//	Возврат "http://arm_mobile";
//	
//КонецФункции

Функция ЗавершитьОбмен(ТекстОшибки)
	//Константы.ПроцентОбмена.Установить(100);
	Константы.ОшибкаОбмена.Установить(ТекстОшибки);
	Лог("Завершение обмена","X");
	Возврат ТекстОшибки;
КонецФункции

Функция ВыполнитьОбменДаннымиПолный() Экспорт
	   ВыполнитьОбменДанными(Ложь);
КонецФункции

Функция ВыполнитьОбменДанными(ЭтоНеПервыйОбмен = Истина) Экспорт
	
	//Тест();
	//Возврат 1;
	
	Попытка
		Константы.ЭтоНеПервыйОбмен.Установить(ЭтоНеПервыйОбмен);
		Если Не ЭтоНеПервыйОбмен Тогда 
			Константы.ДатаОбновлениеСообщений.Установить(ТекущаяДата() - 60 *24 * 3600);
		КонецЕсли;
		
		Лог("Начало обмена",2);
		Попытка
			//Константы.ПроцентОбмена.Установить(0.01);
			Константы.ОшибкаОбмена.Установить("");
			
			
		Исключение
			Возврат ЗавершитьОбмен("Ошибка доступа к константам");
			
		КонецПопытки;
		//Константы.ПроцентОбмена.Установить(0.02);
		Лог("Підключаємось",3);
		Попытка
			Прокси = СоединениеСБазой.ПолучитьПрокси();
		Исключение
			Возврат ЗавершитьОбмен("Не вдалось підключитись до сервера: "+ОписаниеОшибки());
		КонецПопытки;
		//Константы.ПроцентОбмена.Установить(0.03);
		Лог("Готуємо дані для входа на сервер",4);
		Попытка
			СисИнфо = Новый СистемнаяИнформация;
			КодМобильногоКомпьютера = Строка(СисИнфо.ИдентификаторКлиента);
			
			ПарольВхода = СокрЛП(Константы.ПарольВхода.Получить());
			
			Если Не ЗначениеЗаполнено(ПарольВхода) Тогда 
				Возврат ЗавершитьОбмен("Не заповнено пароль для обміну");
			КонецЕсли;	
			
		Исключение
			Возврат ЗавершитьОбмен("Ошибка доступа к данным клиента");
			
		КонецПопытки;
		
		ЭтоНеПервыйОбмен = Константы.ЭтоНеПервыйОбмен.Получить();
		Если НЕ ЭтоНеПервыйОбмен Тогда 
			Лог("Очистка мобільного додатку",7);
			
			Обмен_АнализДанных.УдалитьВсеДанные();    
			Константы.ЭтоНеПервыйОбмен.Установить(Истина);
		КонецЕсли;
		//Константы.ПроцентОбмена.Установить(0.04);
		Лог("Починаємо обмін",5);
		Попытка
			Ошибка = Прокси.НачатьОбмен(СокрЛП(Метаданные.Версия), КодМобильногоКомпьютера, ПарольВхода, ЭтоНеПервыйОбмен); 
		Исключение
			Возврат ЗавершитьОбмен("Не вдалось розпочати обмін. "+ОписаниеОшибки());
		КонецПопытки;
		//Константы.ПроцентОбмена.Установить(0.05);
		
		Лог("Аналіз відповіді початку",6);
		Попытка
			Если Лев(Ошибка,1) <> "*" Тогда
				
				//Если ЗначениеЗаполнено(Ошибка) Тогда 
				Возврат ЗавершитьОбмен(Ошибка);
			КонецЕсли;
			Константы.ОбменВыполняется.Установить(Истина);
			  
			
			
			
			КоличествоПакетов = Число(Сред(Ошибка,2));
			Лог("Всього записів: "+КоличествоПакетов,8);
			
			ТекПакетов = 0;
			Ошибка = "";
			КоличествоДанныхВПакете = 100;
		Исключение
			Возврат ЗавершитьОбмен("Ошибка начала обмена: "+ ОписаниеОшибки());
			
		КонецПопытки;
		//Константы.ПроцентОбмена.Установить(0.06);
		Перший = Истина;
		Пока КоличествоДанныхВПакете > 0 Цикл
			Лог("Запит на пакет даних з сервера",9);
			Попытка
				ДанныеОбмена = Прокси.СформироватьПакетДанных(КодМобильногоКомпьютера, ПарольВхода);
			Исключение
				Возврат ЗавершитьОбмен("Не вдалось сформувати пакет данних для смартфона"+ОписаниеОшибки());
			КонецПопытки;                                     	
			
			Попытка
				ТаблицаИД = Новый ТаблицаЗначений;
				ТаблицаИД.Колонки.Добавить("ИД");
				

				ДанныеОбменаСтруктура = Десериализовать(ДанныеОбмена);
				
				КоличествоДанныхВПакете = ДанныеОбменаСтруктура.КоличествоЗаписейОбмена;
				
				
			    Если КоличествоДанныхВПакете = 0 Тогда  // Перерахуєм дані може не вірно рахуються
					КоличествоДанныхВПакете = ПорахуватиКількістьДанихВПакеті(ДанныеОбменаСтруктура); //Рахуєм кількість даних в пакеті
				КонецЕсли;
				
				
				
				Лог("Кількість даних в пакеті: "+КоличествоДанныхВПакете,"А");
				//Если НЕ ДанныеОбменаСтруктура.Справочники.Номенклатура.Количество()
				//	И НЕ ДанныеОбменаСтруктура.Документы.
				//	Тогда 
				//	Прервать;
				//КонецЕсли;
				Если КоличествоДанныхВПакете <= 0 Тогда 
					Прервать;
					//Константы.ПроцентОбмена.Установить(100);
				КонецЕсли;
				
				
				
				Если ДанныеОбменаСтруктура.ЭтоПолнаяВыгрузка Тогда 
					Лог("Удаляєм всі дані мобільного додатку","Б");
					Обмен_АнализДанных.УдалитьВсеДанные();
				КонецЕсли;   
				
				
				
				 // Перший И ДанныеОбменаСтруктура.Справочники.Контрагенты.Количество() = 0;
				
				//Если НЕ ЭтоНеПервыйОбмен Тогда     // Тут зависає якщо цпосилка
					Лог("Читаєм отримані дані...","В");
				
					Обмен_АнализДанных.ПрочитатьПакетДанных(ДанныеОбменаСтруктура,ТаблицаИД);  /////////////////////////////////////////// Читаєм дані
					Лог("...Закінчили читати дані","Г");
					Лог("Контрагенты в додатку: " + Справочники.Контрагенты.ПолучитьДанныеВыбора(Новый Структура).Количество(), "0!");
					Лог("Контрагенты в отримано: " + ДанныеОбменаСтруктура.Справочники.Контрагенты.Количество(), "1!");
Перший = Ложь;
				//КонецЕсли;
				//Если ДанныеОбменаСтруктура.ЭтоПолнаяВыгрузка Тогда 
				//	Прокси.ВключитьЧастичныйОбмен(ПарольВхода);
				//Иначе
				Если ТаблицаИД.Количество() Тогда 
					Лог("Видаляємо регістрацію... Кол. записів: "+ТаблицаИД.Количество(),"Д");
					Прокси.УдалитьРегистрацию(Сериализовать(ТаблицаИД),ПарольВхода);
								Лог("Видалили регістрацію","Е");
				КонецЕсли;
				ТекПакетов = ТекПакетов + КоличествоДанныхВПакете;
				Лог("Всього записів: "+ТекПакетов+" з "+КоличествоПакетов,"Ж");
				НовПроцент = ТекПакетов * 100 / КоличествоПакетов;
				Если НовПроцент > 100 Тогда 
					НовПроцент = 99;
				КонецЕсли;
				Константы.ПроцентОбмена.Установить(НовПроцент);
				
				//КонецЕсли;
			Исключение
				Лог("Ошибка обмена: "+ОписаниеОшибки(),"З");
				
				
				Ошибка = Ошибка + " Не вдалось обробити отримані дані "+ ОписаниеОшибки();				
				Если НЕ Найти(Ошибка,"Unexpected end of stream on Connection") И НЕ Найти(Ошибка,"unexpected end of stream on Connection") Тогда 
					Возврат ЗавершитьОбмен(Ошибка);
				КонецЕсли;
			КонецПопытки;	
		КонецЦикла;
		
		/////// Відправка змін на сервер  /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		//Лог("Відправка даних на сервер","І");	
		//Попытка
		//	СтруктураОтправки = Обмен_АнализДанных.ОтправитьИзменения();
		//	//Если СтруктураОтправки.Продажи.Количество() ИЛИ СтруктураОтправки.Возвраты.Количество() ИЛИ СтруктураОтправки.НормыЗапасов.Количество()  ИЛИ СтруктураОтправки.Заказы.Количество() Тогда 
		//	//Если  СтруктураОтправки.Заказы.Количество() Тогда 
		//		Рез = Прокси.ОбработатьПакетДанных(ПарольВхода,Сериализовать(Обмен_АнализДанных.ОтправитьИзменения()));     //Відправляємо дані
		//		Если ТипЗнч(Рез) <> Тип("Строка") Тогда 
		//			ОшибкаУдаленияРегистрации = УдалитьРегистрацию(Десериализовать(Рез));
		//		Иначе 
		//			ОшибкаУдаленияРегистрации = Рез;
		//		КонецЕсли;
		//		
		//			
		//		Если ЗначениеЗаполнено(ОшибкаУдаленияРегистрации) Тогда 
		//			Ошибка = Ошибка + " Не вдалось зчитати дані на сервері "+ ОшибкаУдаленияРегистрации;
		//		КонецЕсли;
		//		
		//	//КонецЕсли;               
		//Исключение
		//	Ошибка = Ошибка + " Не вдалось вивантажити дані "+ ОписаниеОшибки();
		//КонецПопытки;
		//Лог("Закінчили відправку на сервер","К");
		
		/////////////////////////////// Читаэм долг партнера
		//Попытка
		//	Константы.ДолгПартнера.Установить(Прокси.ПолучитьДолгПартнера(ПарольВхода));
		//Исключение
		//	Возврат ЗавершитьОбмен("Не вдалось отримати борг партера "+ОписаниеОшибки());
		//КонецПопытки;   	
		
		////////////////////////////////////////////
		
		Константы.ОшибкаОбмена.Установить(Ошибка);
		Константы.ПроцентОбмена.Установить(100);
		НовПроцент = 100;
		Константы.ОбменВыполняется.Установить(Ложь);
		Константы.ДатаОстанньогоОбміну.Установить(ТекущаяДата());
		Возврат Ошибка;
	Исключение
		Возврат ЗавершитьОбмен("Помилка при виконанні обміну "+ ОписаниеОшибки());		
	КонецПопытки;
	
КонецФункции

Функция ВыполнитьОбменДаннымиВыгрузкаЗаказов() Экспорт
	//ЭтоНеПервыйОбмен = Истина;
	Попытка
		
		Лог("Начало обмена",2);
		Попытка
			//Константы.ПроцентОбмена.Установить(0.01);
			Константы.ОшибкаОбмена.Установить("");
			
			
		Исключение
			Возврат ЗавершитьОбмен("Ошибка доступа к константам");
			
		КонецПопытки;
		//Константы.ПроцентОбмена.Установить(0.02);
		Лог("Підключаємось",3);
		Попытка
			Прокси = СоединениеСБазой.ПолучитьПрокси();
		Исключение
			Возврат ЗавершитьОбмен("Не вдалось підключитись до сервера: "+ОписаниеОшибки());
		КонецПопытки;
		//Константы.ПроцентОбмена.Установить(0.03);
		Лог("Готуємо дані для входа на сервер",4);
		Попытка
			СисИнфо = Новый СистемнаяИнформация;
			КодМобильногоКомпьютера = Строка(СисИнфо.ИдентификаторКлиента);
			
			ПарольВхода = СокрЛП(Константы.ПарольВхода.Получить());
			
			Если Не ЗначениеЗаполнено(ПарольВхода) Тогда 
				Возврат ЗавершитьОбмен("Не заповнено пароль для обміну");
			КонецЕсли;	
			
		Исключение
			Возврат ЗавершитьОбмен("Ошибка доступа к данным клиента");
			
		КонецПопытки;
		//Константы.ПроцентОбмена.Установить(0.04);
		Лог("Починаємо обмін",5);
		Попытка
			Ошибка = Прокси.НачатьОбмен(СокрЛП(Метаданные.Версия), КодМобильногоКомпьютера, ПарольВхода,Истина); 
		Исключение
			Возврат ЗавершитьОбмен("Не вдалось розпочати обмін. "+ОписаниеОшибки());
		КонецПопытки;
		//Константы.ПроцентОбмена.Установить(0.05);
		
		Лог("Аналіз відповіді початку",6);
		Попытка
			Если Лев(Ошибка,1) <> "*" Тогда
				
				//Если ЗначениеЗаполнено(Ошибка) Тогда 
				Возврат ЗавершитьОбмен(Ошибка);
			КонецЕсли;
			Константы.ОбменВыполняется.Установить(Истина);
			//ЭтоНеПервыйОбмен = Истина;
			//Если НЕ ЭтоНеПервыйОбмен Тогда 
			//	Лог("Очистка мобільного додатку",7);
			//	
			//	Обмен_АнализДанных.УдалитьВсеДанные();    
			//	Константы.ЭтоНеПервыйОбмен.Установить(Истина);
			//КонецЕсли;  
			
			
			
			КоличествоПакетов = Число(Сред(Ошибка,2));
			Лог("Всього записів: "+КоличествоПакетов,8);
			
			ТекПакетов = 0;
			Ошибка = "";
			КоличествоДанныхВПакете = 100;
		Исключение
			
			Возврат ЗавершитьОбмен("Ошибка начала обмена: "+ ОписаниеОшибки());
			
		КонецПопытки;
		 // Читання змін нема
		///// Відправка змін на сервер  /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		Лог("Відправка даних на сервер","І");	
		Попытка
			СтруктураОтправки = Обмен_АнализДанных.ОтправитьИзменения();
			//Если СтруктураОтправки.Продажи.Количество() ИЛИ СтруктураОтправки.Возвраты.Количество() ИЛИ СтруктураОтправки.НормыЗапасов.Количество()  ИЛИ СтруктураОтправки.Заказы.Количество() Тогда 
			//Если  СтруктураОтправки.Заказы.Количество() Тогда 
			Рез = Прокси.ОбработатьПакетДанных(ПарольВхода,Сериализовать(СтруктураОтправки));     //Відправляємо дані
			РезРаспакованный = Десериализовать(Рез);
			Если ТипЗнч(РезРаспакованный) = Тип("Строка") Тогда 
				Ошибка = Ошибка + " Не вдалось вигрузити дані на сервер "+ РезРаспакованный;
			Иначе 
				Если РезРаспакованный.Свойство("ИнфоМаршруты") Тогда 
					
					Для Каждого Элемент Из РезРаспакованный.ИнфоМаршруты Цикл 
						
						МаршрутныйЛист = Документы.МаршрутныйЛист.ПолучитьСсылку(Элемент.Маршрут);
						Если ПустаяСтрока(МаршрутныйЛист.ВерсияДанных) Тогда 
							Продолжить;
						КонецЕсли;
						

						Объект = МаршрутныйЛист.ПолучитьОбъект();
						Объект.мЭтоОбмен = Истина;
						Объект.НеХватает.Очистить();

						Для Каждого Элемент Из Элемент.НеХватает Цикл 
							СтрокаНеХватает = Объект.НеХватает.Добавить();
							СтрокаНеХватает.ЗаказПокупателя = Документы.Заказ.ПолучитьСсылку(Элемент.Заказ);
							СтрокаНеХватает.Номенклатура 	= Справочники.Номенклатура.ПолучитьСсылку(Элемент.Номенклатура);
							СтрокаНеХватает.Количество 		= Элемент.НеХватает;
						
						КонецЦикла;
						Объект.Записать();
						//++
						Общий.ЗаписатьИсториюРеализацийИзМаршрутного(Объект.Ссылка)
						//++
					КонецЦикла;
				КонецЕсли;
				
				Общий.ЗанестиВИсториюКлиентовСообщиеняПоДокументамПриОбмене(РезРаспакованный.ТаблицаИД);
				
				ОшибкаУдаленияРегистрации = УдалитьРегистрацию(РезРаспакованный.ТаблицаИД);	
				
				
				
				
				Если ЗначениеЗаполнено(ОшибкаУдаленияРегистрации) Тогда 
					Ошибка = Ошибка + " Не вдалось зчитати дані на сервері "+ ОшибкаУдаленияРегистрации;
				КонецЕсли;
				Для Каждого  Сообщение Из РезРаспакованный.МассивОшибок Цикл 
					Ошибка = Ошибка + Сообщение + Символы.ПС;
				КонецЦикла;
				

				
			КонецЕсли;
			
			//КонецЕсли;               
		Исключение
			Ошибка = Ошибка + " Не вдалось вивантажити дані "+ ОписаниеОшибки();
		КонецПопытки;
		Лог("Закінчили відправку на сервер","К");
		
		/////////////////////////////// Читаэм долг партнера
		//Попытка
		//	Константы.ДолгПартнера.Установить(Прокси.ПолучитьДолгПартнера(ПарольВхода));
		//Исключение
		//	Возврат ЗавершитьОбмен("Не вдалось отримати борг партера "+ОписаниеОшибки());
		//КонецПопытки;   	
		
		////////////////////////////////////////////
		
		Константы.ОшибкаОбмена.Установить(Ошибка);
		Константы.ПроцентОбмена.Установить(100);
		НовПроцент = 100;
		Константы.ОбменВыполняется.Установить(Ложь);
		Константы.ДатаОстанньогоОбміну.Установить(ТекущаяДата());
		Возврат Ошибка;
	Исключение
		Возврат ЗавершитьОбмен("Помилка при виконанні обміну "+ ОписаниеОшибки());		
	КонецПопытки;
	
КонецФункции

Функция ВыполнитьОбменДаннымиЗагрузкаТоварів(ЭтоНеПервыйОбмен = Истина) Экспорт
	
	Попытка
		
		Лог("Начало обмена",2);
		Попытка
			Константы.ОшибкаОбмена.Установить("");			
		Исключение
			Возврат ЗавершитьОбмен("Ошибка доступа к константам");		
		КонецПопытки;
		Лог("Підключаємось",3);
		Попытка
			Прокси = СоединениеСБазой.ПолучитьПрокси();
		Исключение
			Возврат ЗавершитьОбмен("Не вдалось підключитись до сервера: "+ОписаниеОшибки());
		КонецПопытки;
		Лог("Готуємо дані для входа на сервер",4);
		Попытка
			СисИнфо = Новый СистемнаяИнформация;
			КодМобильногоКомпьютера = Строка(СисИнфо.ИдентификаторКлиента);			
			ПарольВхода = СокрЛП(Константы.ПарольВхода.Получить());			
			Если Не ЗначениеЗаполнено(ПарольВхода) Тогда 
				Возврат ЗавершитьОбмен("Не заповнено пароль для обміну");
			КонецЕсли;				
		Исключение
			Возврат ЗавершитьОбмен("Ошибка доступа к данным клиента");			
		КонецПопытки;
		Лог("Починаємо обмін",5);
		Попытка
			Ошибка = Прокси.НачатьОбмен(СокрЛП(Метаданные.Версия), КодМобильногоКомпьютера, ПарольВхода, Истина); 
		Исключение
			Возврат ЗавершитьОбмен("Не вдалось розпочати обмін. "+ОписаниеОшибки());
		КонецПопытки;
		//Константы.ПроцентОбмена.Установить(0.05);
		
		Лог("Аналіз відповіді початку",6);
		Попытка
			Если Лев(Ошибка,1) <> "*" Тогда
				
				//Если ЗначениеЗаполнено(Ошибка) Тогда 
				Возврат ЗавершитьОбмен(Ошибка);
			КонецЕсли;
			Константы.ОбменВыполняется.Установить(Истина);
	
			КоличествоПакетов = Число(Сред(Ошибка,2));
			Лог("Всього записів: "+КоличествоПакетов,8);
			
			ТекПакетов = 0;
			Ошибка = "";
			КоличествоДанныхВПакете = 100;
		Исключение
			Возврат ЗавершитьОбмен("Ошибка начала обмена: "+ ОписаниеОшибки());
			
		КонецПопытки;
		Пока КоличествоДанныхВПакете > 0 Цикл
			Лог("Запит на пакет даних з сервера",9);
			Попытка
				ДанныеОбмена = Прокси.ВивантажитиТовари(КодМобильногоКомпьютера, ПарольВхода); /////////////////// Отримання даних
			Исключение
				Возврат ЗавершитьОбмен("Не вдалось сформувати пакет данних для смартфона"+ОписаниеОшибки());
			КонецПопытки;                                     	
			
			Попытка
				ТаблицаИД = Новый ТаблицаЗначений;
				ТаблицаИД.Колонки.Добавить("ИД");
				

				ДанныеОбменаСтруктура = Десериализовать(ДанныеОбмена);
				
				КоличествоДанныхВПакете = ДанныеОбменаСтруктура.КоличествоЗаписейОбмена;
				Лог("Кількість даних в пакеті: "+КоличествоДанныхВПакете,"А");
				Если КоличествоДанныхВПакете <= 0 Тогда 
					Прервать;
				КонецЕсли;
				
				Лог("Читаєм отримані дані...","В");
				
				Обмен_АнализДанных.ПрочитатьПакетДанных(ДанныеОбменаСтруктура,ТаблицаИД);  /////////////////////////////////////////// Читаєм дані
				Лог("...Закінчили читати дані","Г");
				Если ТаблицаИД.Количество() Тогда 
					Лог("Видаляємо регістрацію... Кол. записів: "+ТаблицаИД.Количество(),"Д");
					Прокси.УдалитьРегистрацию(Сериализовать(ТаблицаИД),ПарольВхода);
					Лог("Видалили регістрацію","Е");
				КонецЕсли;
				ТекПакетов = ТекПакетов + КоличествоДанныхВПакете;
				Лог("Всього записів: "+ТекПакетов+" з "+КоличествоПакетов,"Ж");
				НовПроцент = ТекПакетов * 100 / КоличествоПакетов;
				Если НовПроцент > 100 Тогда 
					НовПроцент = 99;
				КонецЕсли;
				Константы.ПроцентОбмена.Установить(НовПроцент);
			Исключение
				Лог("Ошибка обмена: "+ОписаниеОшибки(),"З");
				Ошибка = Ошибка + " Не вдалось обробити отримані дані "+ ОписаниеОшибки();				
				Если НЕ Найти(Ошибка,"Unexpected end of stream on Connection") И НЕ Найти(Ошибка,"unexpected end of stream on Connection") Тогда 
					Возврат ЗавершитьОбмен(Ошибка);
				КонецЕсли;
			КонецПопытки;	
		КонецЦикла;
		
		////////////////////////////////////////////
		
		Константы.ОшибкаОбмена.Установить(Ошибка);
		Константы.ПроцентОбмена.Установить(100);
		НовПроцент = 100;
		Константы.ОбменВыполняется.Установить(Ложь);
		Константы.ДатаОстанньогоОбміну.Установить(ТекущаяДата());
		Возврат Ошибка;
	Исключение
		Возврат ЗавершитьОбмен("Помилка при виконанні обміну "+ ОписаниеОшибки());		
	КонецПопытки;
	
КонецФункции

Функция ВыполнитьОбменДаннымиЗагрузкаКонтрагентів(ЭтоНеПервыйОбмен = Истина) Экспорт
		Попытка
		
		Лог("Начало обмена",2);
		Попытка
			Константы.ОшибкаОбмена.Установить("");			
		Исключение
			Возврат ЗавершитьОбмен("Ошибка доступа к константам");		
		КонецПопытки;
		Лог("Підключаємось",3);
		Попытка
			Прокси = СоединениеСБазой.ПолучитьПрокси();
		Исключение
			Возврат ЗавершитьОбмен("Не вдалось підключитись до сервера: "+ОписаниеОшибки());
		КонецПопытки;
		Лог("Готуємо дані для входа на сервер",4);
		Попытка
			СисИнфо = Новый СистемнаяИнформация;
			КодМобильногоКомпьютера = Строка(СисИнфо.ИдентификаторКлиента);			
			ПарольВхода = СокрЛП(Константы.ПарольВхода.Получить());			
			Если Не ЗначениеЗаполнено(ПарольВхода) Тогда 
				Возврат ЗавершитьОбмен("Не заповнено пароль для обміну");
			КонецЕсли;				
		Исключение
			Возврат ЗавершитьОбмен("Ошибка доступа к данным клиента");			
		КонецПопытки;
		Лог("Починаємо обмін",5);
		Попытка
			Ошибка = Прокси.НачатьОбмен(СокрЛП(Метаданные.Версия), КодМобильногоКомпьютера, ПарольВхода, Истина); 
		Исключение
			Возврат ЗавершитьОбмен("Не вдалось розпочати обмін. "+ОписаниеОшибки());
		КонецПопытки;
		//Константы.ПроцентОбмена.Установить(0.05);
		
		Попытка       
			Данные = Новый Структура("Контрагенты",Истина);
			Изменения = Обмен_АнализДанных.ОтправитьИзменения(Данные);

			Рез = Прокси.ОбработатьПакетДанных(ПарольВхода, Сериализовать(Изменения)); 
			РезРаспакованный = Рез.Получить();
			ОшибкаУдаленияРегистрации = УдалитьРегистрацию(РезРаспакованный.ТаблицаИД);	

		Исключение
			Возврат ЗавершитьОбмен("Не вдалось розпочати обмін. "+ОписаниеОшибки());
		КонецПопытки;
		
		
		Лог("Аналіз відповіді початку",6);
		Попытка
			Если Лев(Ошибка,1) <> "*" Тогда
				
				//Если ЗначениеЗаполнено(Ошибка) Тогда 
				Возврат ЗавершитьОбмен(Ошибка);
			КонецЕсли;
			Константы.ОбменВыполняется.Установить(Истина);
	
			КоличествоПакетов = Число(Сред(Ошибка,2));
			Лог("Всього записів: "+КоличествоПакетов,8);
			
			ТекПакетов = 0;
			Ошибка = "";
			КоличествоДанныхВПакете = 100;
		Исключение
			Возврат ЗавершитьОбмен("Ошибка начала обмена: "+ ОписаниеОшибки());
			
		КонецПопытки;
		
		
		
		Пока КоличествоДанныхВПакете > 0 Цикл
			Лог("Запит на пакет даних з сервера",9);
			Попытка
				ДанныеОбмена = Прокси.ВивантажитиКонтрагентів(КодМобильногоКомпьютера, ПарольВхода); /////////////////// Отримання даних
			Исключение
				Возврат ЗавершитьОбмен("Не вдалось сформувати пакет данних для смартфона"+ОписаниеОшибки());
			КонецПопытки;                                     	
			
			Попытка
				ТаблицаИД = Новый ТаблицаЗначений;
				ТаблицаИД.Колонки.Добавить("ИД");
				

				ДанныеОбменаСтруктура = Десериализовать(ДанныеОбмена);
				
				КоличествоДанныхВПакете = ДанныеОбменаСтруктура.КоличествоЗаписейОбмена;
				Лог("Кількість даних в пакеті: "+КоличествоДанныхВПакете,"А");
				Если КоличествоДанныхВПакете <= 0 Тогда 
					Прервать;
				КонецЕсли;
				
				Лог("Читаєм отримані дані...","В");
				
				Обмен_АнализДанных.ПрочитатьПакетДанных(ДанныеОбменаСтруктура,ТаблицаИД);  /////////////////////////////////////////// Читаєм дані
				Лог("...Закінчили читати дані","Г");
				Если ТаблицаИД.Количество() Тогда 
					Лог("Видаляємо регістрацію... Кол. записів: "+ТаблицаИД.Количество(),"Д");
					Прокси.УдалитьРегистрацию(Сериализовать(ТаблицаИД),ПарольВхода);
					Лог("Видалили регістрацію","Е");
				КонецЕсли;
				ТекПакетов = ТекПакетов + КоличествоДанныхВПакете;
				Лог("Всього записів: "+ТекПакетов+" з "+КоличествоПакетов,"Ж");
				НовПроцент = ТекПакетов * 100 / КоличествоПакетов;
				Если НовПроцент > 100 Тогда 
					НовПроцент = 99;
				КонецЕсли;
				Константы.ПроцентОбмена.Установить(НовПроцент);
			Исключение
				Лог("Ошибка обмена: "+ОписаниеОшибки(),"З");
				Ошибка = Ошибка + " Не вдалось обробити отримані дані "+ ОписаниеОшибки();				
				Если НЕ Найти(Ошибка,"Unexpected end of stream on Connection") И НЕ Найти(Ошибка,"unexpected end of stream on Connection") Тогда 
					Возврат ЗавершитьОбмен(Ошибка);
				КонецЕсли;
			КонецПопытки;	
		КонецЦикла;
		
		////////////////////////////////////////////
		
		Константы.ОшибкаОбмена.Установить(Ошибка);
		Константы.ПроцентОбмена.Установить(100);
		НовПроцент = 100;
		Константы.ОбменВыполняется.Установить(Ложь);
		Константы.ДатаОстанньогоОбміну.Установить(ТекущаяДата());
		Возврат Ошибка;
	Исключение
		Возврат ЗавершитьОбмен("Помилка при виконанні обміну "+ ОписаниеОшибки());		
	КонецПопытки;
	
КонецФункции

Функция ВыполнитьОбменДаннымиЗагрузкаДокументів(ЭтоНеПервыйОбмен = Истина) Экспорт
	
	Попытка
		
		Лог("Начало обмена",2);
		Попытка
			Константы.ОшибкаОбмена.Установить("");			
		Исключение
			Возврат ЗавершитьОбмен("Ошибка доступа к константам");		
		КонецПопытки;
		Лог("Підключаємось",3);
		Попытка
			Прокси = СоединениеСБазой.ПолучитьПрокси();
		Исключение
			Возврат ЗавершитьОбмен("Не вдалось підключитись до сервера: "+ОписаниеОшибки());
		КонецПопытки;
		Лог("Готуємо дані для входа на сервер",4);
		Попытка
			СисИнфо = Новый СистемнаяИнформация;
			КодМобильногоКомпьютера = Строка(СисИнфо.ИдентификаторКлиента);			
			ПарольВхода = СокрЛП(Константы.ПарольВхода.Получить());			
			Если Не ЗначениеЗаполнено(ПарольВхода) Тогда 
				Возврат ЗавершитьОбмен("Не заповнено пароль для обміну");
			КонецЕсли;				
		Исключение
			Возврат ЗавершитьОбмен("Ошибка доступа к данным клиента");			
		КонецПопытки;
		Лог("Починаємо обмін",5);
		Попытка
			Ошибка = Прокси.НачатьОбмен(СокрЛП(Метаданные.Версия), КодМобильногоКомпьютера, ПарольВхода, Истина); 
		Исключение
			Возврат ЗавершитьОбмен("Не вдалось розпочати обмін. "+ОписаниеОшибки());
		КонецПопытки;
		//Константы.ПроцентОбмена.Установить(0.05);
		
		Лог("Аналіз відповіді початку",6);
		Попытка
			Если Лев(Ошибка,1) <> "*" Тогда
				
				//Если ЗначениеЗаполнено(Ошибка) Тогда 
				Возврат ЗавершитьОбмен(Ошибка);
			КонецЕсли;
			Константы.ОбменВыполняется.Установить(Истина);
	
			КоличествоПакетов = Число(Сред(Ошибка,2));
			Лог("Всього записів: "+КоличествоПакетов,8);
			
			ТекПакетов = 0;
			Ошибка = "";
			КоличествоДанныхВПакете = 100;
		Исключение
			Возврат ЗавершитьОбмен("Ошибка начала обмена: "+ ОписаниеОшибки());
			
		КонецПопытки;
		Пока КоличествоДанныхВПакете > 0 Цикл
			Лог("Запит на пакет даних з сервера",9);
			Попытка
				ДанныеОбмена = Прокси.ВивантажитиДокументи(КодМобильногоКомпьютера, ПарольВхода); /////////////////// Отримання даних
			Исключение
				Возврат ЗавершитьОбмен("Не вдалось сформувати пакет данних для смартфона"+ОписаниеОшибки());
			КонецПопытки;                                     	
			
			Попытка
				ТаблицаИД = Новый ТаблицаЗначений;
				ТаблицаИД.Колонки.Добавить("ИД");
				

				ДанныеОбменаСтруктура = Десериализовать(ДанныеОбмена);
				
				КоличествоДанныхВПакете = ДанныеОбменаСтруктура.КоличествоЗаписейОбмена;
				Лог("Кількість даних в пакеті: "+КоличествоДанныхВПакете,"А");
				Если КоличествоДанныхВПакете <= 0 Тогда 
					Прервать;
				КонецЕсли;
				
				Лог("Читаєм отримані дані...","В");
				
				Обмен_АнализДанных.ПрочитатьПакетДанных(ДанныеОбменаСтруктура,ТаблицаИД);  /////////////////////////////////////////// Читаєм дані
				Лог("...Закінчили читати дані","Г");
				Если ТаблицаИД.Количество() Тогда 
					Лог("Видаляємо регістрацію... Кол. записів: "+ТаблицаИД.Количество(),"Д");
					Прокси.УдалитьРегистрацию(Сериализовать(ТаблицаИД),ПарольВхода);
					Лог("Видалили регістрацію","Е");
				КонецЕсли;
				ТекПакетов = ТекПакетов + КоличествоДанныхВПакете;
				Лог("Всього записів: "+ТекПакетов+" з "+КоличествоПакетов,"Ж");
				НовПроцент = ТекПакетов * 100 / КоличествоПакетов;
				Если НовПроцент > 100 Тогда 
					НовПроцент = 99;
				КонецЕсли;
				Константы.ПроцентОбмена.Установить(НовПроцент);
			Исключение
				Лог("Ошибка обмена: "+ОписаниеОшибки(),"З");
				Ошибка = Ошибка + " Не вдалось обробити отримані дані "+ ОписаниеОшибки();				
				Если НЕ Найти(Ошибка,"Unexpected end of stream on Connection") И НЕ Найти(Ошибка,"unexpected end of stream on Connection") Тогда 
					Возврат ЗавершитьОбмен(Ошибка);
				КонецЕсли;
			КонецПопытки;	
		КонецЦикла;
		
		////////////////////////////////////////////
		
		Константы.ОшибкаОбмена.Установить(Ошибка);
		Константы.ПроцентОбмена.Установить(100);
		НовПроцент = 100;
		Константы.ОбменВыполняется.Установить(Ложь);
		Константы.ДатаОстанньогоОбміну.Установить(ТекущаяДата());
		Возврат Ошибка;
	Исключение
		Возврат ЗавершитьОбмен("Помилка при виконанні обміну "+ ОписаниеОшибки());		
	КонецПопытки;
	
КонецФункции

Функция ВыполнитьОбменДаннымиКурсиВалют(Данные) Экспорт
	Ответ = Новый Структура("Результат, Ошибка", Ложь, "");
	Попытка
		Прокси = СоединениеСБазой.ПолучитьПрокси();
	Исключение
		Возврат ЗавершитьОбмен("Не вдалось підключитись до сервера: "+ОписаниеОшибки());
	КонецПопытки;

	
	ПарольВхода = СокрЛП(Константы.ПарольВхода.Получить());			
	Если Не ЗначениеЗаполнено(ПарольВхода) Тогда 
		Ответ.Ошибка =  "Не заповнено пароль для обміну";
		Возврат Ответ;
	КонецЕсли;	
	
	Попытка
		Ответ = Десериализовать(Прокси.ЗаписатиКурсВалют(ПарольВхода, Сериализовать(Данные)));
	Исключение
		Ответ.Ошибка =  "Не вдалось розпочати обмін. " + ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Ответ; 

КонецФункции

Функция ЗавантажитиКурсиВалют() Экспорт
	
	Попытка
		
		Лог("Начало обмена Курс валют",2);
		Попытка
			Константы.ОшибкаОбмена.Установить("");			
		Исключение
			Возврат ЗавершитьОбмен("Ошибка доступа к константам");		
		КонецПопытки;
		Лог("Підключаємось Курс валют",3);
		Попытка
			Прокси = СоединениеСБазой.ПолучитьПрокси();
		Исключение
			Возврат ЗавершитьОбмен("Не вдалось підключитись до сервера: "+ОписаниеОшибки());
		КонецПопытки;
		Лог("Готуємо дані для входа на сервер Курс валют ",4);
		Попытка
			СисИнфо = Новый СистемнаяИнформация;
			КодМобильногоКомпьютера = Строка(СисИнфо.ИдентификаторКлиента);			
			ПарольВхода = СокрЛП(Константы.ПарольВхода.Получить());			
			Если Не ЗначениеЗаполнено(ПарольВхода) Тогда 
				Возврат ЗавершитьОбмен("Не заповнено пароль для обміну Курс валют");
			КонецЕсли;				
		Исключение
			Возврат ЗавершитьОбмен("Ошибка доступа к данным клиента Курс валют");			
		КонецПопытки;
		Лог("Починаємо обмін Курс валют",5);
		Попытка
			Ошибка = Прокси.НачатьОбмен(СокрЛП(Метаданные.Версия), КодМобильногоКомпьютера, ПарольВхода, Истина); 
		Исключение
			Возврат ЗавершитьОбмен("Не вдалось розпочати обмін. Курс валют "+ОписаниеОшибки());
		КонецПопытки;
		//Константы.ПроцентОбмена.Установить(0.05);
		
		Лог("Аналіз відповіді початку Курс валют",6);
		Попытка
			Если Лев(Ошибка,1) <> "*" Тогда
				
				//Если ЗначениеЗаполнено(Ошибка) Тогда 
				Возврат ЗавершитьОбмен(Ошибка);
			КонецЕсли;
			Константы.ОбменВыполняется.Установить(Истина);
	
			КоличествоПакетов = Число(Сред(Ошибка,2));
			Лог("Всього записів: "+КоличествоПакетов,8);
			
			ТекПакетов = 0;
			Ошибка = "";
			КоличествоДанныхВПакете = 100;
		Исключение
			Возврат ЗавершитьОбмен("Ошибка начала обмена Курс валют:  "+ ОписаниеОшибки());
			
		КонецПопытки;
		Лог("Запит на пакет даних з сервера Курс валют",9);
			Попытка
				ДанныеОбмена = Прокси.ОновитиКурси(ПарольВхода); /////////////////// Отримання даних
			Исключение
				Возврат ЗавершитьОбмен("Не вдалось сформувати пакет данних для смартфона Курс валют"+ОписаниеОшибки());
			КонецПопытки;                                     	
			
			Попытка
				
				ДанныеОбменаСтруктура = Десериализовать(ДанныеОбмена);
				Константы.КурсEUR.Установить(ДанныеОбменаСтруктура.В978.Курс);
				Константы.КурсUSD.Установить(ДанныеОбменаСтруктура.В840.Курс);
				ПравоМінятиКурсиВалют = Ложь;
				ДанныеОбменаСтруктура.Свойство("ПравоМінятиКурсиВалют", ПравоМінятиКурсиВалют);  
				Константы.ПравоМінятиКурсиВалют.Установить(ПравоМінятиКурсиВалют);
				
				
				ВідображатиВсіхКлієнтів = Ложь;
				ДанныеОбменаСтруктура.Свойство("ВідображатиВсіхКлієнтів", ВідображатиВсіхКлієнтів);  
				Константы.ВідображатиВсіхКлієнтів.Установить(ВідображатиВсіхКлієнтів);
			
				
				Лог("...Закінчили читати дані Курс валют","Г");
				ТекПакетов = ТекПакетов + КоличествоДанныхВПакете;
				Лог("Всього записів Курс валют: "+ТекПакетов+" з "+КоличествоПакетов,"Ж");
				НовПроцент = 100;
				Константы.ПроцентОбмена.Установить(НовПроцент);
			Исключение
				Лог("Ошибка обмена Курс валют: "+ОписаниеОшибки(),"З");
				Ошибка = Ошибка + " Не вдалось обробити отримані дані "+ ОписаниеОшибки();				
				Если НЕ Найти(Ошибка,"Unexpected end of stream on Connection") И НЕ Найти(Ошибка,"unexpected end of stream on Connection") Тогда 
					Возврат ЗавершитьОбмен(Ошибка);
				КонецЕсли;
			КонецПопытки;	
				
		////////////////////////////////////////////
		
		Константы.ОшибкаОбмена.Установить(Ошибка);
		Константы.ПроцентОбмена.Установить(100);
		НовПроцент = 100;
		Константы.ОбменВыполняется.Установить(Ложь);
		Константы.ДатаОстанньогоОбміну.Установить(ТекущаяДата());
		Возврат Ошибка;
	Исключение
		Возврат ЗавершитьОбмен("Помилка при виконанні обміну "+ ОписаниеОшибки());		
	КонецПопытки;
	
КонецФункции

Функция ОновитьЧат() Экспорт 
	
	ПарольВхода = СокрЛП(Константы.ПарольВхода.Получить());		
	Попытка
		Прокси = СоединениеСБазой.ПолучитьПрокси();
	Исключение
		Возврат ЗавершитьОбмен("Не вдалось підключитись до сервера: "+ОписаниеОшибки());
	КонецПопытки; 
	Попытка 
		ДатаОбмена = Константы.ДатаОбновлениеСообщений.Получить();;
		ИдентификаторУстройства = Константы.ИдентификаторУстройства.Получить();
		Параметры = Сериализовать(Обмен_АнализДанных.ПолучитьИсходящиеСообщения(ДатаОбмена));
		Данные = Десериализовать(Прокси.ОновитьЧат(ПарольВхода, Параметры, ИдентификаторУстройства));
		Обмен_АнализДанных.ПринятьПакетДляМесенджера(Данные, ДатаОбмена);
	Исключение 
		ЗАпись = РегистрыСведений.Лог.СоздатьМенеджерЗаписи();
		Запись.дата = ТекущаяДата();
		Запись.Лог = ОписаниеОшибки();
		Запись.Записать();
	КонецПопытки;
КонецФункции

Процедура ОбмінБоргиТаЦіни() Экспорт
	ВыполнитьОбменДаннымиЗагрузкаКонтрагентів();
	ВыполнитьОбменДаннымиЗагрузкаТоварів();
КонецПроцедуры

Функция ОтправтьДанныеКонтрагентаНапрямую(КонтрагентОбъект) Экспорт
			Лог("Підключаємось",3);
		Попытка
			Прокси = СоединениеСБазой.ПолучитьПрокси();
		Исключение
			Возврат ЗавершитьОбмен("Не вдалось підключитись до сервера: "+ОписаниеОшибки());
		КонецПопытки;
		//Константы.ПроцентОбмена.Установить(0.03);
		Лог("Готуємо дані для входа на сервер",4);
		Попытка
			СисИнфо = Новый СистемнаяИнформация;
			КодМобильногоКомпьютера = Строка(СисИнфо.ИдентификаторКлиента);
			
			ПарольВхода = СокрЛП(Константы.ПарольВхода.Получить());
			
			Если Не ЗначениеЗаполнено(ПарольВхода) Тогда 
				Возврат ЗавершитьОбмен("Не заповнено пароль для обміну");
			КонецЕсли;	
			
		Исключение
			Возврат ЗавершитьОбмен("Ошибка доступа к данным клиента");
			
		КонецПопытки;
		
		//Константы.ПроцентОбмена.Установить(0.04);
		Лог("Починаємо обмін",5);
		Попытка
			Ошибка = Прокси.НачатьОбмен(СокрЛП(Метаданные.Версия), КодМобильногоКомпьютера, ПарольВхода, Истина); 
		Исключение
			Возврат ЗавершитьОбмен("Не вдалось розпочати обмін. "+ОписаниеОшибки());
		КонецПопытки;
		//Константы.ПроцентОбмена.Установить(0.05);
		
		Лог("Аналіз відповіді початку",6);
		Попытка
			Если Лев(Ошибка,1) <> "*" Тогда
				
				//Если ЗначениеЗаполнено(Ошибка) Тогда 
				Возврат ЗавершитьОбмен(Ошибка);
			КонецЕсли;
			Константы.ОбменВыполняется.Установить(Истина);
			  
			
			
			
			КоличествоПакетов = Число(Сред(Ошибка,2));
			Лог("Всього записів: "+КоличествоПакетов,8);
			
			ТекПакетов = 0;
			Ошибка = "";
			КоличествоДанныхВПакете = 100;
		Исключение
			Возврат ЗавершитьОбмен("Ошибка начала обмена: "+ ОписаниеОшибки());
			
		КонецПопытки;
		
			//ТЗОтправки = Обмен_АнализДанных.ОтриматиДаніКонтрагентаДляВідправкиНапряму(КонтрагентОбъект);
			//Рез = Прокси.ЗаписатиЗміниКонтрагента(ПарольВхода,Сериализовать(ТЗОтправки));     //Відправляємо дані

			//РезРаспакованный = Десериализовать(Рез);

			//Если РезРаспакованный <> Истина Тогда 
			//	Возврат ЗавершитьОбмен("Не вдалось записати зміни. " + РезРаспакованный);
			//КонецЕсли;
			
КонецФункции

Функция ПолучитьСектор(ХарактеристикаОбъект, Сектор) Экспорт
			Лог("Підключаємось",3);
		Попытка
			Прокси = СоединениеСБазой.ПолучитьПрокси();
		Исключение
			Возврат ЗавершитьОбмен("Не вдалось підключитись до сервера: "+ОписаниеОшибки());
		КонецПопытки;
		//Константы.ПроцентОбмена.Установить(0.03);
			
			//ТЗОтправки = Обмен_АнализДанных.ОтриматиДаніКонтрагентаДляВідправкиНапряму(КонтрагентОбъект);
		Рез = Прокси.ОтриматиДаніХарактеристики(СокрЛП(ХарактеристикаОбъект.Ссылка.УникальныйИдентификатор()), Сектор);     //Відправляємо дані
		Возврат Рез;
			//РезРаспакованный = Десериализовать(Рез);

			//Если РезРаспакованный <> Истина Тогда 
			//	Возврат ЗавершитьОбмен("Не вдалось записати зміни. " + РезРаспакованный);
			//КонецЕсли;
			
КонецФункции



Функция УдалитьРегистрацию(ТаблицаИД) Экспорт  
	//Попытка
	//	ТаблицаИД = Десериализовать(ДанныеИД);
	//Исключение
	//	Возврат ДанныеИД;
	//КонецПопытки;
	//Продавец = ПолучитьПродавцаПоКодуПартнера(ПарольВхода);
	Для Каждого Строка Из ТаблицаИД Цикл
		Попытка
		ы = Строка.ИД;
		Исключение
			Продолжить;
		КонецПопытки;
		
		нз = РегистрыСведений.РегистрацияОбмена.СоздатьНаборЗаписей();
		нз.Отбор.ИД.Использование = Истина;
		//нз.Отбор.Продавец.Использование = Истина;
		//
		//стр = Строка(Строка.ИД);
		////Лог(Строка(Строка.ИД) + " - "+ Строка(ТипЗнч(Строка.ИД)));
		
		нз.Отбор.ИД.Значение = Строка.ИД;
		нз.Прочитать();
		Если нз.Количество() и (ТипЗнч(нз[0].Объект) = Тип("ДокументСсылка.Заказ") 
			ИЛИ ТипЗнч(нз[0].Объект) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
			ИЛИ ТипЗнч(нз[0].Объект) = Тип("ДокументСсылка.КассовыйОрдер")
			ИЛИ ТипЗнч(нз[0].Объект) = Тип("ДокументСсылка.МаршрутныйЛист")
			ИЛИ ТипЗнч(нз[0].Объект) = Тип("ДокументСсылка.Презентація")) Тогда 
			Документ = нз[0].Объект.получитьОбъект();
			Документ.мЭтоОбмен = Истина;
			Документ.Архив = Истина;
			Документ.В_1с = Истина;

			Документ.Записать();
			
		КонецЕсли;
		нз.Очистить();
		нз.Записать();                            
	КонецЦикла;
	Возврат "";
КонецФункции

Функция ОновитиЗалишкиХарактеристикНоменклатури(Номенклатура) Экспорт
	СтруктураЗапрос = Новый Структура;
	СтруктураЗапрос.Вставить("Номенклатура",Номенклатура.УникальныйИдентификатор()); 
	Прокси = СоединениеСБазой.ПолучитьПрокси();
	ПарольВхода = СокрЛП(Константы.ПарольВхода.Получить());
	Рез = Прокси.ОтриматиЗалишкиХарактеристик(ПарольВхода,Сериализовать(СтруктураЗапрос));
	ТЗ = Десериализовать(Рез);
	Для Каждого Строка Из ТЗ Цикл
		Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Строка.УИДХарактеристикаНоменклатуры);
		Попытка
			СпрОб = Характеристика.ПолучитьОбъект();
			СпрОб.Залишок =  Строка.Остаток;
			СпрОб.Записать();
		Исключение
			
		КонецПопытки;
	КонецЦикла;
	
КонецФункции

Функция ОновитиЗалишкиТаЦіни(Частково = Ложь) Экспорт
	
	//ДокументыПриходу =  Документы.Приход.Выбрать();
	//Если  ДокументыПриходу.Следующий() Тогда  
	//	Приход = ДокументыПриходу.ПолучитьОбъект();
	//Иначе
	//	Приход = Документы.Приход.СоздатьДокумент(); 
	//КонецЕсли;
	//	
	//Приход.Дата = ТекущаяДата();
	//Приход.Товары.Очистить();
	ТаблицаИД = Новый ТаблицаЗначений;
	ТаблицаИД.Колонки.Добавить("ИД");
	
	ТЗ_Цены = Новый ТаблицаЗначений;
	ТЗ_Цены.Колонки.Добавить("Номенклатура");
	ТЗ_Цены.Колонки.Добавить("ТипЦен");

	ТЗ_ПрийнятыхОстатков = Новый ТаблицаЗначений;
	ТЗ_ПрийнятыхОстатков.Колонки.Добавить("ХарактеристикиНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));

	
	Прокси = СоединениеСБазой.ПолучитьПрокси();
	ПарольВхода = СокрЛП(Константы.ПарольВхода.Получить());
	Если Частково Тогда 
		Рез = Прокси.ОновитьОстаткиТаЦеныЧастково(ПарольВхода);
	Иначе 
		Рез = Прокси.ОновитьОстаткиТаЦены(ПарольВхода);
	КонецЕсли;
	Данные = Десериализовать(Рез);
	
	Обмен_АнализДанных.СоздатьЭлементыСправочника("ТипыЦенНоменклатуры", Данные.ТипыЦенНоменклатуры,ТаблицаИД);

	Константы.ПоказыватьЦены.Установить(Данные.ПоказыватьЦены);
	Константы.ПоказыватьЦеныПоставщиков.Установить(Данные.ПоказыватьЦеныПоставщиков);

	ТЗ = Данные.ТЗЦены;
	НаборЗаписейЦен = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
	
	Запрос = Новый  Запрос;
	Запрос.Текст = " Выбрать * Поместить Товары  Из &ТЗ Как Товары; 
					|Выбрать * Из Товары 
					|Итоги Максимум(НаименованиеХарактеристики), Максимум(Вага),  Максимум(Цена), Максимум(ЦенаАкция) , Максимум(Целевой)
					|, Максимум(Остаток) , Максимум(СсылкаНаYouTube), Максимум(Описание), Максимум(Бронь), Максимум(ПериодБрони), Максимум(МояБронь), Максимум(УИДКонтрагент)
					|По УИДНоменклатуры, УИДХарактеристикаНоменклатуры, УИДТипЦен";
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	ВыборкаНоменклатура = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНоменклатура.Следующий() Цикл 
		
		Если не ЗначениеЗаполнено(ВыборкаНоменклатура.УИДНоменклатуры) Тогда 
			Продолжить;
		КонецЕсли;
		
		Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(ВыборкаНоменклатура.УИДНоменклатуры);
		Если ПустаяСтрока(Номенклатура.ВерсияДанных)Тогда 
			Продолжить;
		КонецЕсли;		
		
		ВыборкаХарактеристика = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВстановленаЦена = Ложь;
		Пока ВыборкаХарактеристика.Следующий() Цикл 
			Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(ВыборкаХарактеристика.УИДХарактеристикаНоменклатуры);
			Если ЗначениеЗаполнено(Характеристика) Тогда 
				Если НЕ ПустаяСтрока(Характеристика.ВерсияДанных) И ВыборкаХарактеристика.Остаток  Тогда 
					
					Если Характеристика.Залишок <> ВыборкаХарактеристика.Остаток
						Или Характеристика.Целевой  <> ВыборкаХарактеристика.Целевой
						Или Характеристика.СсылкаНаYouTube  <> ВыборкаХарактеристика.СсылкаНаYouTube 
						Или Характеристика.Описание  <> ВыборкаХарактеристика.Описание 
						Или Характеристика.Бронь  <> ВыборкаХарактеристика.Бронь 
						Или Характеристика.ПериодБрони  <> ВыборкаХарактеристика.ПериодБрони Тогда 
						
						Характ = Характеристика.ПолучитьОбъект();
						Характ.Залишок 				= ВыборкаХарактеристика.Остаток;
						Характ.Целевой 				= ВыборкаХарактеристика.Целевой;
						Характ.СсылкаНаYouTube 		= ВыборкаХарактеристика.СсылкаНаYouTube;
						Характ.Описание 			= ВыборкаХарактеристика.Описание;
						Характ.Бронь  				= ВыборкаХарактеристика.Бронь; 
						Характ.ПериодБрони 			= ВыборкаХарактеристика.ПериодБрони;
						Характ.МояБронь 			= ВыборкаХарактеристика.МояБронь;
						Характ.Контрагент 			= Справочники.Контрагенты.ПолучитьСсылку(ВыборкаХарактеристика.УИДКонтрагент);


						Характ.Записать();
					КонецЕсли;
				Иначе 
					НоваяХарактеристика = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
					НоваяХарактеристика.УстановитьСсылкуНового(Характеристика);
					НоваяХарактеристика.Владелец 		= Номенклатура;
					НоваяХарактеристика.Наименование 	= ВыборкаХарактеристика.НаименованиеХарактеристики;
					НоваяХарактеристика.Вага 			= ВыборкаХарактеристика.Вага;
					НоваяХарактеристика.Залишок 		= ВыборкаХарактеристика.Остаток;
					НоваяХарактеристика.Целевой 		= ВыборкаХарактеристика.Целевой;
					НоваяХарактеристика.СсылкаНаYouTube = ВыборкаХарактеристика.СсылкаНаYouTube;
					НоваяХарактеристика.Описание 		= ВыборкаХарактеристика.Описание;
					НоваяХарактеристика.Бронь  			= ВыборкаХарактеристика.Бронь; 
					НоваяХарактеристика.ПериодБрони 	= ВыборкаХарактеристика.ПериодБрони;
					НоваяХарактеристика.МояБронь 		= ВыборкаХарактеристика.МояБронь;
					НоваяХарактеристика.Контрагент 		= Справочники.Контрагенты.ПолучитьСсылку(ВыборкаХарактеристика.УИДКонтрагент);

					НоваяХарактеристика.Записать();
					Характеристика = НоваяХарактеристика.Ссылка;
				КонецЕсли;	
				Строка = ТЗ_ПрийнятыхОстатков.Добавить();
				Строка.ХарактеристикиНоменклатуры = Характеристика; 
			КонецЕсли;
			
			ВыборкаЦена = ВыборкаХарактеристика.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаЦена.Следующий() Цикл 
				
				Если не ЗначениеЗаполнено(ВыборкаЦена.УИДТипЦен) Тогда 
					Продолжить;                            
				КонецЕсли;
				
				ТипЦен = Справочники.ТипыЦенНоменклатуры.ПолучитьСсылку(ВыборкаЦена.УИДТипЦен);
				Если ПустаяСтрока(ТипЦен.ВерсияДанных)Тогда 
					Продолжить;
				КонецЕсли;
				отбор = Новый Структура("Номенклатура, ТипЦен", Номенклатура, ТипЦен);
				Если  ТЗ_Цены.НайтиСтроки(отбор).Количество() Тогда 
					Продолжить;
				КонецЕсли;

				
				Запись = НаборЗаписейЦен.Добавить();
				Запись.Номенклатура = Номенклатура;
				Запись.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
				Запись.Период = ТекущаяДата();
				Запись.Цена = ВыборкаЦена.Цена;
				Запись.ТипЦен = ТипЦен;
				Запись.ЦенаАкция = ВыборкаЦена.ЦенаАкция;
				//Запись.КонецАкции = ВыборкаЦена.КонецАкции;
				
				ЗаполнитьЗначенияСвойств(ТЗ_Цены.Добавить(), Запись); 
				
			КонецЦикла;                   
		КонецЦикла;	
	КонецЦикла;
	
	
	ЗанультьОстатки(ТЗ_ПрийнятыхОстатков);
	//Приход.Записать(РежимЗаписиДокумента.Проведение);
	НаборЗаписейЦен.Записать();
	
	Если Данные.Свойство("ЦеныПоставщиков") Тогда 
		ЗаписатьЦеныПоставщиков(Данные.ЦеныПоставщиков);
	КонецЕсли;
	
	
КонецФункции


Процедура ЗанультьОстатки(Характеристики)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТЗ.ХарактеристикиНоменклатуры КАК Характеристика
	|ПОМЕСТИТЬ ХН
	|ИЗ
	|	&ТЗ КАК ТЗ
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ХН КАК ХН
	|		ПО (ХН.Характеристика = ХарактеристикиНоменклатуры.Ссылка)
	|ГДЕ
	|	ХН.Характеристика ЕСТЬ NULL
	|	И ХарактеристикиНоменклатуры.Залишок <> 0";
	Запрос.УстановитьПараметр("ТЗ", Характеристики);
	Выборка = Запрос.Выполнить().Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.Залишок = 0;
		Объект.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьЦеныПоставщиков(Данные)  
	Набор = РегистрыСведений.ЦеныПоставщиков.СоздатьНаборЗаписей();
	Выборка = Данные.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(Выборка.УИДНоменклатуры));
		Если Не ЗначениеЗаполнено(Номенклатура.ВерсияДанных) Тогда 
			Продолжить;
		КонецЕсли;
		
		ВыборкаДетали = Выборка.Выбрать();
		Пока ВыборкаДетали.Следующий() Цикл 
			Запись = Набор.Добавить();
			Запись.Номенклатура = Номенклатура;
			Запись.Постачальник = ВыборкаДетали.Поставщик;
			Запись.Цена = ВыборкаДетали.ЦенаЗакупкиВес;
		КонецЦикла;
	КонецЦикла;;
	
	Набор.Записать();
КонецПроцедуры



Функция Десериализовать(XMLСтруктураСериализованногоОбъекта)
	
	СтруктураДаних = XMLСтруктураСериализованногоОбъекта.Получить(); 
	Возврат СтруктураДаних;
	
КонецФункции

Функция ПорахуватиКількістьДанихВПакеті(СтруктураДаних)
	КількістьДаних = 0;
	Для Каждого ЭлементСтр Из СтруктураДаних.Документы.Заказы Цикл
		КількістьДаних = КількістьДаних + 1;
	КонецЦикла;
	Для Каждого ЭлементСтр Из СтруктураДаних.Документы.МаршрутныйЛист Цикл
		КількістьДаних = КількістьДаних + 1;
	КонецЦикла;
	Для Каждого ЭлементСтр Из СтруктураДаних.Документы.Реализация Цикл
		КількістьДаних = КількістьДаних + 1;
	КонецЦикла;
	Для Каждого ЭлементСтр Из СтруктураДаних.РегистрСведений.КатегорииОбъектов Цикл
		КількістьДаних = КількістьДаних + 1;
	КонецЦикла;
	Для Каждого ЭлементСтр Из СтруктураДаних.РегистрСведений.ЦеныНоменклатуры Цикл
		КількістьДаних = КількістьДаних + 1;
	КонецЦикла;
	Для Каждого ЭлементСтр Из СтруктураДаних.РегистрСведений.Штрихкоды Цикл
		КількістьДаних = КількістьДаних + 1;
	КонецЦикла;
	Для Каждого ЭлементСтр Из СтруктураДаних.Справочники.ЕдиницыИзмерения Цикл
		КількістьДаних = КількістьДаних + 1;
	КонецЦикла;
	Для Каждого ЭлементСтр Из СтруктураДаних.Справочники.Контрагенты Цикл
		КількістьДаних = КількістьДаних + 1;
	КонецЦикла;
	//Для Каждого ЭлементСтр Из СтруктураДаних.Справочники.Маршруты Цикл
	//	КількістьДаних = КількістьДаних + 1;
	//КонецЦикла;
	Для Каждого ЭлементСтр Из СтруктураДаних.Справочники.Нагадування Цикл
		КількістьДаних = КількістьДаних + 1;
	КонецЦикла;
	Для Каждого ЭлементСтр Из СтруктураДаних.Справочники.Номенклатура Цикл
		КількістьДаних = КількістьДаних + 1;
	КонецЦикла;
	Для Каждого ЭлементСтр Из СтруктураДаних.Справочники.ХарактеристикиНоменклатуры Цикл
		КількістьДаних = КількістьДаних + 1;
	КонецЦикла;
	Возврат КількістьДаних;
КонецФункции


Функция Сериализовать(Структура) Экспорт
	

	Возврат Новый ХранилищеЗначения(Структура,Новый СжатиеДанных(9));
	
КонецФункции

Процедура Лог(Текст,Порядок)Экспорт 
	Возврат;
	
	нз = РегистрыСведений.Лог.СоздатьНаборЗаписей();
	Если Текст = "СбросЛога" Тогда 
		//нз.Записать();
		Возврат;
	КонецЕсли;
	ТекДата = Формат(ТекущаяДата(),"ДЛФ=T") + " "+Строка(Порядок);
	нз.Отбор.Дата.Установить(ТекДата);
	з = нз.Добавить();
	з.Дата = ТекДата;
	з.Лог = Текст;
	нз.Записать();	
КонецПроцедуры

Функция ОбновлениеИнфоОБрониМешков() Экспорт;
	Попытка
		Прокси = СоединениеСБазой.ПолучитьПрокси();
		Пароль = Константы.ПарольВхода.Получить();
		
		Данные = Новый Структура;
		Данные.Вставить("Команда", "ЗапросНаОбновлениеИнформацииОБрони");
		Ответ = Прокси.ЗабронюватиНоменклатуру(Пароль, Сериализовать(Данные));
		Ответ = Ответ.Получить();
		Массив = Новый Массив;
		Если Ответ.Успешно Тогда 
			Для Каждого Элемент из Ответ.ИнфоОБрони Цикл 
				Массив.Добавить(Элемент.УИД);
				
				Вага =  Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Элемент.УИДХарактеристики);
				Если ПустаяСтрока(Вага.ВерсияДанных) Тогда 
					Продолжить;
				КонецЕсли;
				
				ВагаОбъект = Вага.ПолучитьОбъект();
				ВагаОбъект.Бронь = Элемент.Бронь;
				ВагаОбъект.ПериодБрони 		= Элемент.ПериодБрони;
				ВагаОбъект.МояБронь 		= Элемент.МояБронь;
				ВагаОбъект.Контрагент 		= Справочники.Контрагенты.ПолучитьСсылку(Элемент.УИДКонтрагент);
				ВагаОбъект.Открыт 			= Элемент.Открыт;
				ВагаОбъект.СекторНаСкладі 	= Элемент.СекторНаСкладі;
				ВагаОбъект.Коментар 		= Элемент.Коментар;

				ВагаОбъект.Записать();
			КонецЦикла;
			
		Иначе
			Сообщить(Ответ.Ошибка);
		КонецЕсли; 
		
		
		Данные.Вставить("Команда", "ОтветНаОбновлениеИнформацииОБрони");
		Данные.Вставить("МассивИД", Массив);
		Ответ = Прокси.ЗабронюватиНоменклатуру(Пароль, Сериализовать(Данные));
		
	Исключение 
		Текст = ИнформацияОбОшибке();
	КонецПопытки;
	
	
	
	
КонецФункции

Процедура ОбновитьИдентификаторПолучателя() Экспорт
	
	Прокси = СоединениеСБазой.ПолучитьПрокси();
	СисИнфо = Новый СистемнаяИнформация;
	КодМобильногоКомпьютера = Строка(СисИнфо.ИдентификаторКлиента);

	ПарольВхода = СокрЛП(Константы.ПарольВхода.Получить());
	КлючПодписчикаУведомлений = Константы.КлючПодписчикаУведомлений.Получить();
	
	Если КлючПодписчикаУведомлений.Получить() = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	
	Если Не ЗначениеЗаполнено(ПарольВхода) Тогда 
		ЗавершитьОбмен("Не заповнено пароль для обміну");
		Возврат;
	КонецЕсли;	
	
	Данные = Новый Структура;
	Данные.Вставить("ИдентификаторПриложения", КодМобильногоКомпьютера);
	Данные.Вставить("ИдентификаторПолучателя", КлючПодписчикаУведомлений);
	
	Ошибка = Прокси.ОбновитьКлиента(ПарольВхода, Сериализовать(Данные));
	
КонецПроцедуры

Процедура УстановитьДатуОбновлений() Экспорт
	Константы.ДатаОбновлениеСообщений.Установить(Неопределено);	
КонецПроцедуры


Функция Тест() Экспорт 
	Лог("Тест обмен", "1");
	
	Прокси = СоединениеСБазой.ПолучитьПрокси();
	СисИнфо = Новый СистемнаяИнформация;
	КодМобильногоКомпьютера = Строка(СисИнфо.ИдентификаторКлиента);			
	ПарольВхода = СокрЛП(Константы.ПарольВхода.Получить());		
	і = 0;
	Пока і < 10 Цикл 
		
		Попытка
			СисИнфо = Новый СистемнаяИнформация;
			КодМобильногоКомпьютера = Строка(СисИнфо.ИдентификаторКлиента);
			
			ПарольВхода = СокрЛП(Константы.ПарольВхода.Получить());
			
			Если Не ЗначениеЗаполнено(ПарольВхода) Тогда 
				Возврат ЗавершитьОбмен("Не заповнено пароль для обміну");
			КонецЕсли;	
			
		Исключение
			Возврат ЗавершитьОбмен("Ошибка доступа к данным клиента");
			
		КонецПопытки;

		Попытка
			Ошибка = Прокси.НачатьОбмен(СокрЛП(Метаданные.Версия), КодМобильногоКомпьютера, ПарольВхода,Константы.ЭтоНеПервыйОбмен.Получить()); 
		Исключение
			Возврат ЗавершитьОбмен("Не вдалось розпочати обмін. "+ОписаниеОшибки());
		КонецПопытки;
		//Константы.ПроцентОбмена.Установить(0.05);
		
		Лог("Аналіз відповіді початку",6);
		Попытка
			Если Лев(Ошибка,1) <> "*" Тогда
				
				//Если ЗначениеЗаполнено(Ошибка) Тогда 
				Возврат ЗавершитьОбмен(Ошибка);
			КонецЕсли;
			Константы.ОбменВыполняется.Установить(Истина);
			ЭтоНеПервыйОбмен = Константы.ЭтоНеПервыйОбмен.Получить();
			Если НЕ ЭтоНеПервыйОбмен Тогда 
				Лог("Очистка мобільного додатку",7);
				
				Обмен_АнализДанных.УдалитьВсеДанные();    
				Константы.ЭтоНеПервыйОбмен.Установить(Истина);
			КонецЕсли;  
			
			
			
			КоличествоПакетов = Число(Сред(Ошибка,2));
			Лог("Всього записів: "+КоличествоПакетов,8);
			
			ТекПакетов = 0;
			Ошибка = "";
			КоличествоДанныхВПакете = 100;
		Исключение
			Возврат ЗавершитьОбмен("Ошибка начала обмена: "+ ОписаниеОшибки());
			
		КонецПопытки;
		//Константы.ПроцентОбмена.Установить(0.06);
		Перший = Истина;
		
			Лог("Запит на пакет даних з сервера",9);
			Попытка
				ДанныеОбмена = Прокси.СформироватьПакетДанных(КодМобильногоКомпьютера, ПарольВхода);
			Исключение
				Возврат ЗавершитьОбмен("Не вдалось сформувати пакет данних для смартфона"+ОписаниеОшибки());
			КонецПопытки;                                     	
			

		//Ошибка = Прокси.НачатьОбмен(СокрЛП(Метаданные.Версия), КодМобильногоКомпьютера, ПарольВхода, Ложь); 
		//
		//Лог("реєстрація", "1");
		//
		//
		//ДанныеОбмена = Прокси.СформироватьПакетДанных(КодМобильногоКомпьютера, ПарольВхода);
		//
		ДанныеОбменаСтруктура = Десериализовать(ДанныеОбмена);
		//
		//КоличествоДанныхВПакете = ДанныеОбменаСтруктура.КоличествоЗаписейОбмена;
		//	
		Лог("Контрагенты в отримано: " + ДанныеОбменаСтруктура.Справочники.Контрагенты.Количество(), і);
		
		і = і + 1;
	КонецЦикла;
	
КонецФункции


Функция ОбновлениеСтатусовЗаказов() Экспорт 
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Заказ.Контрагент КАК Контрагент
		|ИЗ
		|	Документ.Заказ КАК Заказ
		|
		|СГРУППИРОВАТЬ ПО
		|	Заказ.Контрагент";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			КонтрагентОбъект = ВыборкаДетальныеЗаписи.Контрагент.ПолучитьОбъект();
			Ответ = Неопределено;
			КонтрагентОбъект.ОновитиСтатусиЗакаів(Ответ);
		КонецЦикла;
		
	Исключение 
		Текст = ИнформацияОбОшибке();
	КонецПопытки;	
	
		
КонецФункции	

Процедура ОбменХарактеристикНоменклатуры();
	
	ПарольВхода = СокрЛП(Константы.ПарольВхода.Получить());		
	Попытка
		Прокси = СоединениеСБазой.ПолучитьПрокси();
	Исключение
		Возврат;
	КонецПопытки; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка,
		|	ХарактеристикиНоменклатуры.СекторНаСкладі КАК СекторНаСкладі,
		|	ХарактеристикиНоменклатуры.Коментар КАК Коментар,
		|	РегистрацияОбмена.ИД КАК ИД,
		|	ХарактеристикиНоменклатуры.Открыт КАК Открыт
		|ИЗ
		|	РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|		ПО РегистрацияОбмена.Объект = ХарактеристикиНоменклатуры.Ссылка";
	
	Данные = Запрос.Выполнить().Выгрузить();
	Данные.Колонки.Добавить("УИД_Ссылка");
	Для Каждого Элемент Из Данные Цикл 
		
		Элемент.УИД_Ссылка = Элемент.Ссылка.УникальныйИдентификатор();
		
	КонецЦикла;
	
	Параметры = Новый Структура;
	Параметры.Вставить("Команда", "ИзмененияХарактеристик");
	Параметры.Вставить("Параметры", Данные);
	
	Попытка
		Ответ = Прокси.ВыполнитьКоманду(ПарольВхода, Сериализовать(Параметры));  
	    ДанныеОтвет = Ответ.Получить();
		Для Каждого Элемент Из ДанныеОтвет.Данные Цикл 
			Запись = РегистрыСведений.РегистрацияОбмена.СоздатьМенеджерЗаписи();
			Запись.Объект = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Элемент.УИД);
			Запись.ИД = Элемент.ИД;
			Запись.Удалить();
		КонецЦикла;
	Исключение
		
	КонецПопытки;
	
	
	
КонецПроцедуры


Процедура ФоновыйОбмен() Экспорт
	
	Дата_АвтоОбновлениеЧата1с 			= ТекущаяДата();
	Дата_ОбновлениеБрони 				= ТекущаяДата();
	Дата_БоргиТаЦіни 					= ТекущаяДата();
	Дата_АвтоОбновлениеСтатусовЗаказов 	= ТекущаяДата();
	Дата_ОбменНапоминаний				= ТекущаяДата();
	Дата_ОбменХарактеристик				= ТекущаяДата();
	//Дата_ИзмененияДанных				= ТекущаяДата();

	
	Пока Истина Цикл 
		Константы.ДатаПоследнегоФоновогоОбновления.Установить(ТекущаяДата());
		мДатаНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
		Если ТекущаяДата() > Дата_АвтоОбновлениеЧата1с + 2 Тогда 	
			Обмен_УправлениеОбменом.ОновитьЧат();
			Дата_АвтоОбновлениеЧата1с = ТекущаяДата();
		КонецЕсли;
		
		Если ТекущаяДата() > Дата_ОбновлениеБрони + 2 Тогда 	
			Обмен_УправлениеОбменом.ОбновлениеИнфоОБрониМешков();
			Дата_ОбновлениеБрони = ТекущаяДата();
		КонецЕсли;
		
		Если Константы.АвтоматичнийОбмінБоргиТаЦіни.Получить() 
			И ТекущаяДата() > Дата_БоргиТаЦіни + 5 Тогда 	
			Обмен_УправлениеОбменом.ОбмінБоргиТаЦіни();
			Дата_БоргиТаЦіни = ТекущаяДата();
		КонецЕсли;
		
		Если ТекущаяДата() > Дата_АвтоОбновлениеСтатусовЗаказов + 3600 Тогда 
			ОбновлениеСтатусовЗаказов();
			Дата_АвтоОбновлениеСтатусовЗаказов = ТекущаяДата();
		КонецЕсли;
		
		Если ТекущаяДата() >  Дата_ОбменНапоминаний + 120 Тогда 
			Общий.ЗагрузитьОчередьНапоминанийСДействием();
			Дата_ОбменНапоминаний = ТекущаяДата();
		КонецЕсли;
		
		Если ТекущаяДата() >  Дата_ОбменХарактеристик + 60 Тогда 
			ОбменХарактеристикНоменклатуры();
			Дата_ОбменХарактеристик = ТекущаяДата();
		КонецЕсли;
		
		//Если ТекущаяДата() >  Дата_ИзмененияДанных + 60 Тогда 
		//	ОбменХарактеристикНоменклатуры();
		//	Дата_ИзмененияДанных = ТекущаяДата();
		//КонецЕсли;

		
		
		Отбор = Новый Структура;
		Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
		Задания = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
		Для Каждого ФЗ Из Задания Цикл 
			
			Если ФЗ.Ключ = "ФоновыйОбмен" Тогда 
				Продолжить;
			КонецЕсли;
			
			ФЗ.Отменить();
			Попытка
				Выполнить ФЗ.ИмяМетода + "()";
			Исключение
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = ОписаниеОшибки();
				Сообщение.Сообщить();
			КонецПопытки;
		КонецЦикла;
		мДатаОкончания = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ВремяОбмена = мДатаОкончания - мДатаНачала;
	КонецЦикла;
	
КонецПроцедуры
